---
kind: property
id: P:Autodesk.Revit.DB.Wall.Orientation
zh: 墙、墙体
source: html/0aa38eaf-be9c-3dd9-f0e4-621847cfcb63.htm
---
# Autodesk.Revit.DB.Wall.Orientation Property

**中文**: 墙、墙体

The normal vector projected from the exterior side of the wall.

## Syntax (C#)
```csharp
public XYZ Orientation { get; }
```